Autodesk.Revit.DB.FabricationConfiguration.IsAncillaryKit(System.Int32)
Gets whether the specified fabrication ancillary identifier is an ancillary kit or not.
ancillaryId:
The fabrication ancillary database identifier of the ancillary.
Returns:
Returns true if the ancillary is a kit.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAncillaryGroupName(System.Int32)
Gets the fabrication ancillary group and name for the specified fabrication ancillary identifier.
ancillaryId:
The fabrication ancillary database identifier of the ancillary.
Returns:
The group and name of the ancillary.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAncillaryGroup(System.Int32)
Gets the fabrication ancillary group of the specified fabrication ancillary identifier.
ancillaryId:
The fabrication ancillary database identifier of the ancillary.
Returns:
The group name of the ancillary.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetAncillaryName(System.Int32)
Gets the fabrication ancillary name for the specified fabrication ancillary identifier.
ancillaryId:
The fabrication ancillary database identifier of the ancillary.
Returns:
The name of the ancillary.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetPartCustomDataType(System.Int32)
Gets the custom data type from its identifier. See FabricationCustomDataType enumerator.
statusId:
The custom data identifier.
Returns:
The custom data type.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetPartCustomDataName(System.Int32)
Gets the custom data name from its identifier.
statusId:
The custom data identifier.
Returns:
The custom data name.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationConfiguration.GetDamperName(System.Int32)
Gets the damper name from its identifier.
damperId:
The damper identifier.
Returns:
The damper name.
Since:
2017 Subscription Update